## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 6 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210702182404676800000002"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_appstore_metrics:11" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_appstore_metrics:11" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                # (1 unchanged element hidden)
                {
                    cpu                   = 0
                    environment           = []
                    essential             = true
                    firelensConfiguration = {
                        options = {
                            enable-ecs-log-metadata = "true"
                        }
                        type    = "fluentbit"
                    }
                    image                 = "amazon/aws-for-fluent-bit:latest"
                    memory                = 128
                    mountPoints           = []
                    name                  = "log_router"
                    portMappings          = []
                    user                  = "0"
                    volumesFrom           = []
                },
              ~ {
                  - environment      = [] -> null
                  ~ image            = "falcosecurity/falco:0.17.1" -> "falcosecurity/falco:master"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_appstore_metrics" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.masked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_inapp_metrics_event_rule-terraform-20210709151104003100000001"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_inapp_metrics:1" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_inapp_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_inapp_metrics:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                # (1 unchanged element hidden)
                {
                    cpu                   = 0
                    environment           = []
                    essential             = true
                    firelensConfiguration = {
                        options = {
                            enable-ecs-log-metadata = "true"
                        }
                        type    = "fluentbit"
                    }
                    image                 = "amazon/aws-for-fluent-bit:latest"
                    memory                = 128
                    mountPoints           = []
                    name                  = "log_router"
                    portMappings          = []
                    user                  = "0"
                    volumesFrom           = []
                },
              ~ {
                  - environment      = [] -> null
                  ~ image            = "falcosecurity/falco:0.17.1" -> "falcosecurity/falco:master"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_inapp_metrics" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210702182404782300000005"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:17" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:17" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                # (1 unchanged element hidden)
                {
                    cpu                   = 0
                    environment           = []
                    essential             = true
                    firelensConfiguration = {
                        options = {
                            enable-ecs-log-metadata = "true"
                        }
                        type    = "fluentbit"
                    }
                    image                 = "amazon/aws-for-fluent-bit:latest"
                    memory                = 128
                    mountPoints           = []
                    name                  = "log_router"
                    portMappings          = []
                    user                  = "0"
                    volumesFrom           = []
                },
              ~ {
                  - environment      = [] -> null
                  ~ image            = "falcosecurity/falco:0.17.1" -> "falcosecurity/falco:master"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_appstore_metrics_event_rule-terraform-20210702182404731800000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_appstore_metrics:11" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_appstore_metrics:11" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                # (1 unchanged element hidden)
                {
                    cpu                   = 0
                    environment           = []
                    essential             = true
                    firelensConfiguration = {
                        options = {
                            enable-ecs-log-metadata = "true"
                        }
                        type    = "fluentbit"
                    }
                    image                 = "amazon/aws-for-fluent-bit:latest"
                    memory                = 128
                    mountPoints           = []
                    name                  = "log_router"
                    portMappings          = []
                    user                  = "0"
                    volumesFrom           = []
                },
              ~ {
                  - environment      = [] -> null
                  ~ image            = "falcosecurity/falco:0.17.1" -> "falcosecurity/falco:master"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_appstore_metrics" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_inapp_metrics_event_rule-terraform-20210709151104082600000002"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_inapp_metrics:1" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_inapp_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_inapp_metrics:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                # (1 unchanged element hidden)
                {
                    cpu                   = 0
                    environment           = []
                    essential             = true
                    firelensConfiguration = {
                        options = {
                            enable-ecs-log-metadata = "true"
                        }
                        type    = "fluentbit"
                    }
                    image                 = "amazon/aws-for-fluent-bit:latest"
                    memory                = 128
                    mountPoints           = []
                    name                  = "log_router"
                    portMappings          = []
                    user                  = "0"
                    volumesFrom           = []
                },
              ~ {
                  - environment      = [] -> null
                  ~ image            = "falcosecurity/falco:0.17.1" -> "falcosecurity/falco:master"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_inapp_metrics" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210702182404726800000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:19" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:19" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                # (1 unchanged element hidden)
                {
                    cpu                   = 0
                    environment           = []
                    essential             = true
                    firelensConfiguration = {
                        options = {
                            enable-ecs-log-metadata = "true"
                        }
                        type    = "fluentbit"
                    }
                    image                 = "amazon/aws-for-fluent-bit:latest"
                    memory                = 128
                    mountPoints           = []
                    name                  = "log_router"
                    portMappings          = []
                    user                  = "0"
                    volumesFrom           = []
                },
              ~ {
                  - environment      = [] -> null
                  ~ image            = "falcosecurity/falco:0.17.1" -> "falcosecurity/falco:master"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 19 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 6 to add, 6 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>